In [1]:
import numpy as np
import pandas as pd

Write a Pandas program to create and display a DataFrame from the following dictionary data with index labels.

exam_data = {'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],

'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],

'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],

'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']}

labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']

In [2]:
exam_data = {'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']}
labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']

In [3]:
df1 = pd.DataFrame(exam_data,index = labels)

In [4]:
df1

        name  score  attempts qualify
a  Anastasia   12.5         1     yes
b       Dima    9.0         3      no
c  Katherine   16.5         2     yes
d      James    NaN         3      no
e      Emily    9.0         2      no
f    Michael   20.0         3     yes
g    Matthew   14.5         1     yes
h      Laura    NaN         1      no
i      Kevin    8.0         2      no
j      Jonas   19.0         1     yes

1. Print the three first rows using the head() method.

2. Delete rows with Nan values.

3. Extract the 'name' and 'score' columns from the DataFrame.

4. Write a Pandas program to append a new row 'k' to the DataFrame with these values (name: "Suresh", score: 15.5, attempts: 1, qualify: "yes").

5. Write a Pandas program to delete the 'attempts' column from the DataFrame.

6. Add a new column "Success": if the score is higher than 10 we will have 1, else we will have 0.

7. After executing the final DataFrame, export it into a CSV file named "my_data".

1. Print the three first rows using the head() method.

In [5]:
df1.head(3)

        name  score  attempts qualify
a  Anastasia   12.5         1     yes
b       Dima    9.0         3      no
c  Katherine   16.5         2     yes

2. Delete rows with Nan values.

In [6]:
df1.dropna()

        name  score  attempts qualify
a  Anastasia   12.5         1     yes
b       Dima    9.0         3      no
c  Katherine   16.5         2     yes
e      Emily    9.0         2      no
f    Michael   20.0         3     yes
g    Matthew   14.5         1     yes
i      Kevin    8.0         2      no
j      Jonas   19.0         1     yes

3. Extract the 'name' and 'score' columns from the DataFrame.

In [7]:
df1.columns

Index(['name', 'score', 'attempts', 'qualify'], dtype='object')

In [8]:
for idx,column in enumerate(df1.columns):
    print(idx,column)

0 name
1 score
2 attempts
3 qualify

In [9]:
df1.loc[:,'name']

a    Anastasia
b         Dima
c    Katherine
d        James
e        Emily
f      Michael
g      Matthew
h        Laura
i        Kevin
j        Jonas
Name: name, dtype: object

In [10]:
df1['score']

a    12.5
b     9.0
c    16.5
d     NaN
e     9.0
f    20.0
g    14.5
h     NaN
i     8.0
j    19.0
Name: score, dtype: float64

In [11]:
df1_new = df1.dropna()

In [12]:
df1_new

        name  score  attempts qualify
a  Anastasia   12.5         1     yes
b       Dima    9.0         3      no
c  Katherine   16.5         2     yes
e      Emily    9.0         2      no
f    Michael   20.0         3     yes
g    Matthew   14.5         1     yes
i      Kevin    8.0         2      no
j      Jonas   19.0         1     yes

Write a Pandas program to append a new row 'k' to the DataFrame with these values (name: "Suresh", score: 15.5, attempts: 1, qualify: "yes").

In [13]:
df1_new.loc['k'] = {'name': "Suresh", 'score': 15.5, 'attempts': 1, 'qualify': "yes"}

/var/folders/m6/t912xmd176sgkbvdy2hcngqh0000gn/T/ipykernel_832/2243011460.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df1_new.loc['k'] = {'name': "Suresh", 'score': 15.5, 'attempts': 1, 'qualify': "yes"}

In [14]:
df1_new

        name  score  attempts qualify
a  Anastasia   12.5         1     yes
b       Dima    9.0         3      no
c  Katherine   16.5         2     yes
e      Emily    9.0         2      no
f    Michael   20.0         3     yes
g    Matthew   14.5         1     yes
i      Kevin    8.0         2      no
j      Jonas   19.0         1     yes
k     Suresh   15.5         1     yes

Write a Pandas program to delete the 'attempts' column from the DataFrame.

In [15]:
df1_new = df1_new.drop(columns='attempts')

Add a new column "Success": if the score is higher than 10 we will have 1, else we will have 0.

In [16]:
df1_new['Success'] = [1 if df1_new.iloc[i,1] > 10 else 0 for i in range(0,len(df1_new['name']))]

In [17]:
df1_new

        name  score qualify  Success
a  Anastasia   12.5     yes        1
b       Dima    9.0      no        0
c  Katherine   16.5     yes        1
e      Emily    9.0      no        0
f    Michael   20.0     yes        1
g    Matthew   14.5     yes        1
i      Kevin    8.0      no        0
j      Jonas   19.0     yes        1
k     Suresh   15.5     yes        1

2eme methode avec np.select

In [18]:
df1_new

        name  score qualify  Success
a  Anastasia   12.5     yes        1
b       Dima    9.0      no        0
c  Katherine   16.5     yes        1
e      Emily    9.0      no        0
f    Michael   20.0     yes        1
g    Matthew   14.5     yes        1
i      Kevin    8.0      no        0
j      Jonas   19.0     yes        1
k     Suresh   15.5     yes        1

In [19]:
conditionlist = [(df1_new['score'] > 10),
                (df1_new['score'] <= 10)]

In [20]:
choicelist = [1,0]

In [21]:
df1_new['SuccessNpWhere'] = np.select(conditionlist, choicelist, default='Not Specified')

In [22]:
df1_new

        name  score qualify  Success SuccessNpWhere
a  Anastasia   12.5     yes        1              1
b       Dima    9.0      no        0              0
c  Katherine   16.5     yes        1              1
e      Emily    9.0      no        0              0
f    Michael   20.0     yes        1              1
g    Matthew   14.5     yes        1              1
i      Kevin    8.0      no        0              0
j      Jonas   19.0     yes        1              1
k     Suresh   15.5     yes        1              1

7. After executing the final DataFrame, export it into a CSV file named "my_data".

In [24]:
df1_new.to_csv('20230815_FichierCheckpoint6.csv')